class Public::HomesController < ApplicationController
  
    # =================================================================================
    # トップページ画面（GETアクション）
    # =================================================================================
    def top
        @items = Item.order(updated_at: :desc).first(4)
    end

    # =================================================================================
    # アバウト画面（GETアクション）
    # ※インスタンス変数の値は表示しないためcontrollerでの処理はなし
    # =================================================================================
    def about
    end
end
