class Public::ItemsController < ApplicationController
    
    # =================================================================================
    # 商品一覧画面（GETアクション）
    # =================================================================================
    def index
        @items = Item.page(params[:page]).per(8)
    end
    
    # =================================================================================
    # 商品詳細画面（GETアクション）
    # =================================================================================
    def show
        @item = Item.find(params[:id])
        @cart_item = Cart_item.new
    end
end
